!
#
$
%
&
'
(
)
*
+
,
-
.
/
0
0,0
0,4
0.00008
0.00010101
0.00027
0.00031
0.00033
0.0008
0.001
0.0010101
0.0017
0.004
0.0048
0.006
0.007
0.0077
0.008
0.0088
0.009
0.01
0.012
0.014
0.016
0.02
0.0204
0.023
0.025
0.03
0.0320
0.036
0.037
0.04
0.0483
0.05
0.06
0.064
0.066
0.07
0.070
0.0729
0.076
0.08
0.082
0.086
0.0873
0.09
0.096
0.098
0.1
0.10
0.12
0.125
0.125125
0.127
0.128
0.129
0.132
0.137
0.14
0.144
0.15
0.16
0.17
0.18
0.2
0.20
0.212
0.217
0.225
0.24
0.25
0.3
0.30
0.3010
0.30103
0.317
0.318
0.319
0.33
0.33320
0.3364
0.34
0.35
0.36
0.37
0.375
0.38
0.4
0.40
0.42
0.43
0.48
0.49
0.5
0.50
0.51
0.525
0.54
0.55
0.6
0.60
0.61
0.625
0.63
0.64
0.650
0.66
0.7
0.70
0.72
0.75
0.76
0.8
0.80
0.81
0.82
0.85
0.86
0.865
0.87
0.889
0.9
0.90
0.92
0.96
00
00,000
000
000,000
00000
000216
000343
0025
003
004
01
014
02554
03
04
05
06
07
07.50
08
09
1
1,000
1,001
1,002
1,003
1,004
1,005
1,006
1,008
1,034
1,046
1,054
1,100
1,160
1,2
1,300
1,325
1,350
1,439
1,440
1,500
1,585
1,600
1,800
1,980
1.00
1.003
1.05
1.07
1.08
1.1
1.10
1.14
1.15
1.17
1.2
1.20
1.21
1.25
1.26
1.275
1.28
1.3
1.30
1.35
1.375
1.38
1.4
1.40
1.414
1.42
1.44
1.45
1.49
1.5
1.50
1.5625
1.6
1.61
1.7
1.70
1.75
1.79
1.8
1.80
1.81
1.85
1.86
1.87
1.89
1.9
1.92
1.95
1.956
1.96
10
10,0
10,000
10,800
10.0
10.00
10.1
10.10
10.3
10.5
10.50
10.7
10.80
100
100,000
100.00
100.4
100.48
100.70
1000
10000
100000
1000000
100000000
1000000000
1001
10010
10010000
100100000
1002
1004
1008
100889
10092
101
101.20
101.25
101.50
1010
1015
10154
101600
1019
102
1020
10200
1021
1023
102325
1024
1025
1025.68
1029
10290
103
10350
1036
10368
104
104.25
1040
1044
1045
1048
1049
105
1050
10500
1051
1052
1053
1054
1055
1056
106
106.25
10628
1064
107
107.25
1073
1076
1077
108
108.0
108.25
1080
10800
1086
109
109.25
109.90
109300
10936
10940
10976
10996
11
11.00
11.25
11.4
11.5
11.50
11.52
11.545
11.67
11.95
11.98
110
110.60
1100
11000
110000
11002
1101
1105
111
111.30
1110
1111
1115
1116
112
112.70
1120
11200
1122
11248
1125
1127
1129
113
1136
114
11400
115
115.19
115.2
1150
1152
1156
116
1160
11600
116000
11628
117
1170
11730
11780
118
1180
1182
1183
119
1190
11901
1192
12
12,000
12,250
12,356
12,500
12,880
12.0
12.00
12.05
12.1
12.1212
12.2
12.4
12.45
12.48
12.5
12.50
12.55
12.6
12.60
12.75
12.8
12.80
12.808
12.86
12.87
12.952
120
120,000
120.50
1200
12000
120000
12004
12005
12015
1202
1203
1204
1206
121
1210
12100
12100.00
1212
121212
1215
12160
12167
122
1220
12200
12234322
1224
1225
1227
1229
123
1230
12300
1232
12344321
12345
123454321
1234562
123456789101112131415161718192021222324252627282930313233343536373839404142434481
1235
1236
123678
12375
1239
124
1240
12401
1242
1245
12450
125
1250
12500
125000
1251
1252140
1253
1254
1255
126
126.15
1260
12600
1265
127
1270
12700
12702
1272
1274
1275
1277
128
1280
128000
1285
1287
12880
129
129.6
1290
129024
1296
13
13,000
13,400
13,800
13.0
13.00
13.165
13.25
13.26
13.27
13.30
13.33
13.4
13.5
13.50
13.69
13.82
13.85
13.86
130
1300
13000
130000
1301
1305
1307
131
1311
1313
1315
132
1320
13200
1325
1330
1331
1335
134
1340
1344
1345
1348.32
135
135.21
1350
13500
13500.00
1351
1356
136
1360
13600
13602
13603
13604
13605
1365
13650
13698
137
1370
1375
1377
13787
138
1380
13800
1383
1386
13860
1387
139.00
1390
1395
13970
1399.45
14
14,0
14,000
14,400
14,800
14.0
14.00
14.05
14.2
14.25
14.30
14.4
14.5
14.50
14.6
14.66
14.70
14.8
14.9
140
1400
14000
140000
1400000
1404
1406
14080
140800
141
1412
1419
142
142.07
14200
1425
1427
1428
1429
143
1430
14300
144
1440
14400
1442
14452
145
14500
1452
1455
1456
146
1464
14698
147
147.14
1470
14784
148
1480
148000
149
1490
1491
14916
1491625
15
15,000
15,0000
15,500
15.00
15.1
15.2
15.3
15.4
15.5
15.6
15.65
15.7
15.8
150
1500
15000
150000
150100
1504
151
1510
151022
1512
1515
1517.25
152
1520
153
1530
1536
154
1540
155
1550
15500
1551
1554
15540
1557
156
156.62
15652
1568
1569
15698
1575
158
158.40
158.50
159
159161
15968
16
16,000
16,500
16.036
16.2
16.25
16.3
16.30
16.4
16.45
16.5
16.6
16.8
16.80
16.9
160
160.50
1600
16000
161
16128
1615
162
162.50
1620
1623
1628
163
164
164.50
1640
1642
165
165.6
1650
16500
1657
165826
166
1661
16698
167
1670
1672
16781
168
1680
16800
16807
169
17
17.0005
17.1
17.12
17.28
17.5
17.56
170
1700
17000
170000
1701
1702
171
1717
172
1720
1728
172835
1729
173
1734
174
1740
175
1750
17500
176
1760
1764
17640
17698
177
178
17820
1782452
179
1792
18
18,000
18,400
18,500
18.00
18.5
18.75
18.8
180
1800
18000
1802
181
1816
182
1820
1821
183
18300
183652
18396
184
184.80
1848
185
1850
18500
18522
1856
186
1860
18600
1862
187
18750
188
1880
18888
189
1890
18900
1894
19
19,000
19,443
19,683
19.36
19.4
19.50
19.6
19.7
19.8
190
1900
19000
19008
1904
1908
1917
192
192,000
19200
192000
1929
193
1938.8
19404
19413846
1944
1947
195
1950
19500
19532
1955
196
19614181
19683
197
1971
1972
19732
1979
198
1980
1982
1983
19832
1984
1985
1987
1988
1989
199
1990
1991
1992
1993
1994
1995
1996
1997
1998
1999
2
2,0
2,000
2,100
2,200
2,3
2,400
2,480
2,500
2,600
2,700
2.0
2.00
2.00001
2.0017
2.017
2.04
2.05
2.09
2.1
2.10
2.11
2.12
2.125
2.13
2.134
2.16
2.2
2.20
2.25
2.3
2.30
2.35
2.4
2.40
2.44
2.49
2.5
2.50
2.502
2.52
2.54
2.56256
2.6
2.65
2.68
2.75
2.8
2.80
2.85
2.9
2.90
2.95
20
20,000
20,45
20.00
20.000
20.04
20.08
20.10
20.25
20.4
20.40
20.42
20.43
20.5
20.50
20.65
20.75
20.8
200
200.00
200.4
200.50
2000
20000
200000
20004
2001
2002
2003
200300
2005
2006
2007
2008
2009
201
2010
2011
2012
20122012
2013
20132013
2014
2015
2016
2017
202
202.50
2020
20210
2024
2025
202541
2028
203
2030
2032
2037
204
2045
2047
2048
205
2050
206
2060
207
207.00
208
2080
2086
209
2090
21
21.0
21.25
21.3
21.6
210
210,000
2100
21000
2108
2109
21093
211
211.00
2114
21168
212
2120
21200
2128
213
213.0
2136
214
214.18
215
215546
216
2160
21600
2166
217
218
219
22
22,000
22,500
22.4
22.5
22.6
220
220,000
2200
22000
22050
2206
221
2210
2211
222
223
2235
224
2240
224000
225
2250
22500
226
2268
228
2280
228712
22932
23
23.4
23.5
23.75
230
2300
23000
2304
23040
231
2310
23100
232
232342
233
234
2340
2345
2348
235
2350
236
2360
2370
23700
238
2380
239
24
24,000
24.00
24.2
24.5
24.68
240
240,000
2400
24000
2408
241
2415
242
2420
2424
243
2430
24336
2435
2436
244
2442
2445
245
2450
2451
246
2460
24624
2468
247
2475
248
249
2496
25
25,000
25.2
25.20
25.25
25.35
25.4
25.5
25.6
250
250.00
250.10
2500
25000
251
252
2520
25200
2524.36
2525
2527
2535
254
255
2550
2550.25
2552.36
2553
256
2560
2562
258
2590
26
26.1
26.3
26.50
260
2600
26000
260000
262
262.85
263
264
2640
265
2652
266
2660
2665
267
2678
268
2688
269
2691
27
27.2
27.3
27.4
27.5
27.8
270
2700
27000
2704
271
27160
2717
2718
272
272738
273
27300
274
2743
2744
27452
275
276
2769
278
2783
279
2795
28
28,000
28.00
28.75
28.8
28.9
280
2800
28000
281
28160
282
2828.80
283
284
285
28523
2855
286
287
288
2880
289
2890
28943712
29
29.25
29.75
29.94
290
2904
292
2920
2923
2926
293
295
2952400
296
297832
298
2994
2999
3
3,000
3,150
3,320
3,381
3,500
3,600
3.0
3.00
3.00001
3.06
3.08
3.1
3.10
3.134
3.14
3.15
3.16
3.2
3.20
3.241
3.242
3.25
3.3
3.33
3.4
3.40
3.45
3.456789
3.49
3.5
3.50
3.6
3.60
3.62
3.64
3.7
3.74
3.75
3.78
3.8
3.85
3.87
3.9
3.95
3.96
30
30,000
30.00
30.09
300
300,000
3000
30000
301
302
3024
3025
303
3034
3040
305
3054
306
307.50
308
3081
3087
31
31,000
31,360
31.00
31.50
310
310,000
3100
310000
3104.35
3105
31100
31111
312
3125
3135
3136
314
314.12
314.16
3146
315
3150
316
3168
319
3198
32
32,000
32.00
32.08
32.20
32.25
32.49
32.5
320
320,000
3200
32000
321
3213
3214
322
3220
323
3230
3239
324
3240
325
32519
325475
326.40
3267
327
3294
329864
33
33.3
33.34
330
3300
3315
332
3320
333
333.18
33300
334
3341
335
335,000
336
3360
3362
337
3375
338
34
34.1
34.9
340
340,000
3400
34000
3408
341
342
343
3435
344
345
34500
346
347
348
348340
3486
349
35
35,000
35.00
35.1
35.25
350
3500
35000
350400
351
352
3520
3540
355
3550
3552
3553
356
3562
357
358
36
36,000
36.00001
36.5
36.50
360
3600
36000
361
3620
362855
363
3639
364
36400
3648
365
3650
366
368
3680
369
3699
37
37.3
37.5
370
370.80
373
375
3750
376
377
378
378461
3795
38
38.25
38.3
38.7
38.9
380
3800
3815
383.6
3830
384
384,000
3840
385
3850
3854.002
3855
3872
388
3889
39
39.4
390
3900
392
3921
3923
3927
3940
39424
395
396
3960
3969
397
397.75
398
3999
4
4,0
4,000
4,10
4,4
4,600
4,970
4.00
4.036
4.1
4.2
4.20
4.3
4.4
4.40
4.5
4.50
4.6
4.60
4.7
4.70
4.75
4.8
4.90
4.98
40
40,000
40.00
40.00001
40.2
40.25
400
4000
40000
4003
4004
4008
401
4015
4016.25
402
4020.75
4025.25
403
4032
4034.25
404
4040
404415
4048
405
4050
4052.25
406
407
4070
408
4096
41
410
4107
411
412
4128
413
4136
4137
414
415
416.25
42
42,000
42,500
42,900
42.0
42.00
42.24
42.5
42.75
420
4200
42000
422
422.50
423
4230
42398
424
42400
425
425.50
426
427
427398
427751
42900
43
43,560
430
43000
432
4320
4321
433124
4332
43334
434
434.75
4340
435
435,961
4351
4356
436
437
4375
4386
44
44,000
44.5
440
4400
44000
441
4410
443
444
4440
445
4455
445876
448
4489
449
4499
45
45.00
45.15
45.5
450
4500
45000
451
452
4521
4545
455
4550
4555
456
4560
457
458
4582
459
4590
46
46,827
46.20
46.5
460
462
4624
463
4636
465
465.50
4650
4665
468
46800
469
469111
469138
469157
469158
469160
47
47.5
47.50
470
4700
4704
4725
474
475
476
4761
48
48.0
48.73
480
4800
48000
4802
481
482
482466
484
48456
486
4860
4864
487.50
488
489.1375
4893
49
490
4900
49000
4913
492
4940
495
4950
496
496.80
4960
4970
5
5,0
5,000
5,280
5,4
5,500
5,8
5,9
5.0
5.00
5.00001
5.02
5.10
5.2
5.20
5.23
5.25
5.3
5.30
5.35
5.4
5.40
5.44
5.45
5.5
5.50
5.6
5.60
5.7
5.70
5.76
5.8
5.80
5.94
5.95
5.96
50
50,000
50.20
50.25
50.4
50.50
50.7
500
500,000
5000
50000
500000
501
502
5020
50248
503
504
504.35
5040
505
5050
5060
507
509
509509
51
51.27
51.50
510
5100
511
51132
512
512.5
512.50
51200
51234
5124
512456
5136
514
514.16
5161
516615
517
5184
52
52.0
52.5
52.8
520
5200
52000
52115
522
5225
523
524
525
5250
526
5264
5265
5266
527
527500
528
5280
529
5292
53
53.42
530
5300
531,441
532
5321
5366
537
5376
53824
539
5399
54
54,000
540
5400
54000
540000
54179759
5420
5432
544
545
5454
546
5468
547
5474827
548
549
55
550
550.00
5500
55000
5505
551
552.50
5548
555
5568
559981
56
56.16
560
5600
56000
560000
561
562
5625
5636
564823
565
5650
5660
567
56700
5678
568
568219
5689
57
57,600
57.33
57.5
57.76
570
5700
57000
572
5720
5744
575
5750
576
5766
5768
578
58
58.4
58.8
580
5800
58000
5808
581
5824
582964
583
58408
585
586.25
586.75
5864
586645
588
5880
5888
59
59,049
59.29
59.85
59.95
590
5900
59000
5921
5922
594
594000
595
598
5998
6
6,0
6,000
6,12
6,2
6,7
6.0
6.00
6.00001
6.1
6.12
6.2
6.25
6.3
6.30
6.32
6.35
6.4
6.40
6.45
6.5
6.50
6.6
6.7
6.75
6.8
6.83
6.85
60
60,000
60.5
60.50
60.80
600
600,000
6000
60000
600000
6016.75
602
6029
604
6048
605
6069
6075
608
6088
609
60900
61
61.11
61.2
61.472
61.5
61.74
610
6100
612
6122
6124
615
616
617.50
618
61900
62
62,500
62.0
62.5
62.50
620
6200
62000
62216
6235
624
624,938
625
6250
62500
62519
625573
62684
627
6270
62900
62976
63
63.0
630
6300
63000
631
632
6335
6345
6348
6350
637
638
64
64.0
64.50
640
6400
64000
642
642986
6433
6435
6440
645
64500
646
648
6480
64900
65
650
6500
65000
6514
652
6524
652543
653
6535
655
6562
656452
657903
65793
6580
658217
6588
66
66.2
66.5
66.50
660
6600
66000
662
6635
664
6647
6650
666
66900
67
67.5
67.50
670
6700
672
6720
6735
675
6750
675958
676
678
6788
679
68
68,000
68,800
68.50
680
6800
68000
6804
684
6840
68400
685
6855
6859
686
689
69
69,600
69.0
69.28
690
690.47
6900
6905
6912
6927
693
6936
696.05
696.30
69696
698
69900
7
7,000
7,1
7,4
7,500
7.00
7.00001
7.1
7.10
7.14
7.2
7.20
7.3
7.30
7.35
7.5
7.50
7.6
7.68
7.686
7.8
7.80
70
70,400
70.50
70.69
700
7000
70000
7020
704
708
7080
7098060
71
71.4
710
712.5
7125
713
72
72.50
72.95
720
7200
72000
7201
722425
7225
723
7230
724946
725
72514
72516
72518
72519
726
728
728400
729
72900
73
730
731
7314
734
735
7350
7380
7392
74
74.50
74.95
740
7400
74000
7435
744
745
747
747.50
748
749
75
75.12
75.50
750
7500
75000
752
753
7538
754
755
756
7560
7562
757
759,325
76
76.4
76.50
760
76000
761
7636
764
765
7669
768
76800
77
77.31
77.44
77.95
770
7700
77000
7720
7740
775
777
78
78.2
780
780.38
7800
78000
780000
781
782
784
7844213
7855
7858
786
787
79
79.95
790
792
7920
7921
7927
794
795
79523
7967
8
8,000
8,12
8,3
8,4
8,9
8.0
8.00
8.000001
8.00001
8.036
8.076
8.1
8.2
8.25
8.3
8.30
8.4
8.40
8.5
8.50
8.55
8.6
8.64
8.75
8.77
8.8
8.82
80
80,000
80.5
800
8000
80000
8001
801
80641
8091
81
810
8100
81000
810472
8110
8112
812
815
8160
819200
82
82.50
82.8
820
8200
8210
8215
821562
823,435
8230
8236
824.85
825
82500
82519
8261955
828
8280
829
83
830
8300
8310
832
83200
8325
833
8337
8340
836
84
84.95
840
840.00
8400
841
8410
8435
8450
847
84942
85
85,000
85.0
85.5
85.50
85.96
850
8500
85000
8510
852
852755
853845
854
855
8550
856,736
8562
856973
858
8587
859622
859722
86
86.1
86.12
86.49
860
8600
86038
864
8640
8679921
87
87.5
87.50
870
8700
872
8720
8748
875
87953.0727
88
880
880,702
8800
880702
8820
883
8840
8855
887.75
888
8880
89
89.95
890
8900
891
892
8925
8927
896
897326
899
899830
9
9,000
9,100
9.0
9.00
9.1103
9.15
9.2
9.24
9.25
9.30
9.43
9.5
9.50
9.65
9.75
9.8
9.80
9.85
9.9
9.95
9.97
90
90,000
900
9000
90000
900000
901
902
91
910
9100
912
913
915
92
92,000
92.00
92.16
92.581
920
9200
9211
923
9230
924
925
92555
9261
927
928
929
929,260
929260
93
93.00
93.6
930
931
935
936
9375
94
940
940.00
9408
9409
941
942,568
942568
945
948
95
95.45
950
9500
9506
9548
956
956734
96
96.12
96.15
96.16
96.2
96.25
960
9600
96348621
964807
9671
9679
968
97
97,500
970
972
9720
975
9750
97500
976
9773
9783
979
98
98.90
980
9800
982
9823
98348
984
985
985420
9855
987
9873
987654
988
9890
99
99.749
990
993
997
9974
9975
998
999
9990
9999
999919
999936
999951
999975
999984
99999
:
;
<
<eos>
<pad>
<sos>
<unk>
=
>
?
@
[
]
^
_
__
___
____
_____
______
_________
`
a
aa
aaron
aarti
ab
abc
abcd
abce
abcpqra
abe
abel
abhay
abhinav
abhishek
abi
able
about
above
abroad
abs
absence
absent
absolute
abstract
ac
academic
academy
acceleration
accept
accepted
accepts
access
accident
accidentally
accidents
accommodate
accommodated
accompanying
accomplish
according
account
accountant
accounted
accounting
accounts
accrued
accumulated
accurately
acd
acde
achieve
achieved
acid
acidic
acme
acoustics
acquire
acquired
acre
acres
across
action
activities
actual
actually
ad
ada
adam
add
addded
added
adding
addison
addition
additional
additive
additives
adds
addvertisement
ade
adi
adjacent
adjusts
administrator
admission
admissions
admits
admitted
admitting
adolescence
adrienne
adult
adults
advance
advanced
advances
advertise
advertisement
advertising
advised
ae
aec
aegf
aero
aeroplane
aerospace
af
afce
afford
aforementioned
afraid
africa
after
afternoon
afternoons
afterwards
ag
again
against
age
aged
agencies
agency
agent
agents
ages
aggregate
ago
agree
agreed
agrees
agricultural
ahd
ahead
ai
air
airborne
aircraft
airfare
airfield
airline
airliners
airlines
airplane
airplanes
airport
airports
aisle
aisles
ajay
ajith
ak
akbar
al
alarm
albany
albert
alberto
album
alchemerion
alcohol
alcoholic
alex
alfred
algebra
algebraic
algorithm
alice
aligned
alive
all
allergic
alley
allison
allocated
allocates
allocations
allotted
allow
allowance
allowed
allowing
allows
alloy
alloys
allthe
almonds
alok
alone
along
alongside
alphabet
alphabets
already
also
alteration
altered
alternate
alternately
alternating
alternative
alternatively
altitude
altogether
always
am
aman
amanda
amar
amateur
amateurs
amazing
ambulance
amby
america
american
amit
amitabh
amith
amithab
ammonium
among
amongs
amongst
amound
amoung
amount
amounted
amountof
amounts
amritsar
amusement
amy
an
ana
analog
analysis
analysts
anand
anangletis
ananthu
anatomy
anchorge
and
andbase
andbequals
andeach
andg
andhas
andhra
andnow
andrea
andrew
andx
andy
angelina
angelo
angle
angled
angles
anglets
angstroms
anil
animal
animals
anita
ann
anna
anne
annie
annika
anniversary
announced
annual
annually
annum
anoop
another
ans
answer
answered
answers
ant
antecedent
anthill
anthony
anti
antidote
antiques
antony
ants
anunfaircoin
anusha
anvil
anwar
any
anyone
anytown
anywhere
ap
apart
apartment
apartments
apex
apiece
appear
appearances
appeared
appearing
appears
appended
appetizer
apple
apples
appliance
appliances
applicants
application
applications
applied
apply
appointed
apprentices
appropriate
approx
approximate
approximately
approximates
approximation
april
aprofit
aptitude
aquarium
aram
arbitrary
arbour
arc
arcade
are
area
areaof
areas
aremainder
ares
aristocrat
arithmetic
arithmetical
arjun
army
arnold
around
arranged
arrangement
arrangements
array
arrival
arrive
arrived
arrives
arriving
arrow
art
arthur
article
articles
artist
artois
arts
arule
arun
as
ascending
asf
ashis
ashley
ashok
ashtikar
ashutosh
ashwin
asia
aside
ask
asked
asking
aspeed
asphalt
asquare
asquotient
assembled
assembling
assembly
assessed
assesses
assets
assign
assigned
assignment
assigns
assisants
assist
assistance
assistant
assisted
associate
associates
association
assume
assumed
assuming
asterisks
asteroid
asteroids
astrophysics
at
ate
athe
athens
athlete
athletes
athletic
athul
atlanta
atlantic
atoms
atriangle
attached
attaching
attain
attemp
attempted
attempting
attempts
attend
attendance
attendants
attended
attendees
attending
attends
atthe
attracted
attracts
audio
audrey
august
aunt
austin
author
auto
automatic
automobile
automobiles
automotive
available
availed
ave
avearge
avenue
avenues
average
averaged
averageincome
averages
averagge
averaging
avergae
avery
avg
avgof
avgwgt
aviv
avrg
award
awarded
away
ax
axe
axis
axle
axles
axyd
az
b
ba
babies
babji
baby
babysitter
back
backward
backyard
bacteria
bacterium
bad
badamba
badminton
bag
bags
bake
baked
baker
bakery
baking
bala
balan
balance
balcony
ball
balls
ballsare
balone
balu
banana
bananas
band
bangalore
bangles
bank
banker
bankers
banking
banks
banksat
banquet
banu
bar
barbata
barbed
barber
barbershop
barefooted
bargain
bargainer
barium
barkely
barley
barrel
barrels
barry
bars
base
baseball
based
basement
bases
basic
basis
basket
basketball
baskets
bass
bat
batch
batches
bath
bats
batsman
batsmen
batter
batteries
battery
batting
bb
bbq
bby
bc
bced
bd
be
beach
beaches
beaker
beans
bear
bearing
bears
beat
beaten
beats
beauro
beauty
beavers
became
because
become
becomes
becoming
bed
bedroom
beds
bee
beef
beehive
beehives
beekeeper
been
beer
bees
beetle
before
began
beggar
beggining
begin
begining
beginner
beginning
begins
begun
behind
beige
being
bella
bells
belong
belonged
below
belt
beluga
ben
bench
beneath
beneficiaries
beneficiary
benefit
benefits
benjamin
benny
bent
bernie
berries
berry
bert
bess
best
bet
beth
bets
better
betty
between
beverage
beverages
bexy
beyond
bf
bhanu
bharatpur
bhaskar
bhatia
bhavan
bhishma
bhupathi
bhuvan
bianca
bicycle
bicycled
bicycles
bicyclist
big
bigger
biggest
bike
biked
biker
bikes
biking
bil
bill
billboard
billion
bills
billy
binary
bind
binders
bindres
bindu
binoy
biographies
biography
biological
biology
biotechnology
bipin
birch
birches
bird
birds
birdseed
birmingham
birth
birthday
birthdays
bis
black
blackboard
blade
blank
blankets
blanks
blast
blazes
bleach
bleached
blend
blended
blends
blindly
blistering
block
blocks
blog
blonde
blown
blu
blue
blueberries
bluegrass
bluejays
bluetooth
board
boarders
boards
boat
boatman
boats
bob
bodies
body
boeing
boggies
boggy
bogies
boiling
boils
bolivia
bolts
bombardment
bombay
bonbon
bond
bones
bonus
bonuses
book
bookcases
bookman
books
bookseller
bookshelf
bookshop
bookstore
booth
boots
border
born
borrow
borrowed
borrows
boss
boston
both
bottle
bottled
bottles
bottom
bought
boulevard
bounce
bound
boundaries
boundary
bouquets
boutique
bow
bowl
bowler
bowling
bowls
box
boxed
boxes
boy
boys
boysand
brad
brain
brainiacs
brakes
branch
brand
branded
brands
brass
brdge
bread
breadht
breads
breadth
break
breakfast
breaking
breaks
breath
breeder
breeding
bren
brenda
brian
brick
bricks
bridge
briefcase
brim
brindavan
bring
bringing
brings
bristol
british
broad
broke
broken
broker
brokerage
bronze
brother
brothers
brought
brown
bruce
bs
btw
bucket
buckets
budget
budgeted
budgets
budweiser
buff
buffaloes
buffet
build
building
buildings
builds
built
bulb
bulbs
bule
bull
bullet
bullets
bulls
bunnies
burger
burgers
burning
bus
buses
bushel
bushes
business
but
butter
butterfat
butterflies
butterfly
buy
buyer
buyers
buying
buys
buzness
bv
bx
by
c
ca
cab
cabbage
cabbages
cabinet
cable
cafeteria
cage
cages
caging
cake
cakes
cal
calcatta
calcualte
calculate
calculated
calculating
calculation
calculus
calcutta
caleb
calendar
calf
call
called
callie
calls
calories
cam
came
camel
camels
camera
cameron
camp
campaign
camped
campers
camping
can
canada
candidate
candidates
candidateswho
candies
candle
candles
cando
candy
candys
cane
canister
canned
cannel
cannever
cannons
canoe
canoes
cans
canteen
canvas
capable
capacities
capacity
capita
capital
capitals
caps
capsule
capsules
capt
captain
captured
capulet
car
cara
caramel
caravan
carbon
carbonated
carburetor
card
cardboard
cards
care
career
carefully
carey
cargo
carina
carl
carla
carlisle
carmen
carnations
carnival
carol
carolina
carpenter
carpenters
carper
carpet
carpeting
carpets
carriages
carrie
carried
carrier
carries
carrots
carry
carrying
cars
cart
carton
cartons
carve
carved
case
cases
cash
cashed
cashew
cashews
cashier
cast
caste
casted
castroville
casts
cat
catch
catches
catching
categories
category
catered
caterer
catering
catfish
catherine
cats
catsto
cattle
caught
cauliflower
cauliflowers
cause
causes
cave
cb
cc
ccb
cd
cdef
ce
cef
ceiling
celebrate
celebrated
celebrating
cell
cellphone
celsius
cement
census
cent
center
centerpiece
centers
centimer
centimeter
centimeters
centimetre
centimetres
central
centre
cents
century
ceo
cereal
cereals
certain
certificate
certificates
certified
cfo
chain
chains
chair
chairman
chairmen
chairs
challenge
champion
championship
chance
chances
chandan
chandigarh
change
changed
changein
changes
changing
channel
channels
chapati
chapatis
characteristic
characters
charan
charge
charged
charges
charging
charitable
charities
charity
charles
charlie
chart
chartered
charts
chase
chased
chases
chasing
cheaper
cheats
check
checkbook
checked
checkpoints
checks
cheerleader
cheerleaders
cheese
cheetah
cheetahs
chef
chefs
chemical
chemicals
chemist
chemistry
chemists
chennai
cherry
cheryl
chess
chetan
chewing
chicago
chicken
chickens
child
children
childrens
chile
chili
chinese
chip
chips
chloride
chlorination
chlorine
chocolate
chocolates
choice
choices
choose
choosen
chooses
choosing
chopped
chopping
chops
chord
chords
chorus
chose
chosen
chris
christ
christina
christine
christmas
christopher
chrome
chromium
chudi
ci
cigarettes
cindy
cinematic
circle
circles
circuit
circular
circularplace
circulars
circulation
circumference
circumferences
circumferential
circumscribing
circus
cistern
citern
cities
citizens
city
claimed
claims
claire
clarified
class
classes
classroom
clean
cleaners
cleaning
cleans
clear
clearance
cleared
clerical
clerk
clerks
clermontville
cleveland
client
clients
cliff
climate
climb
climbed
climbing
climbs
clip
clips
clock
clocks
clockwise
close
closed
closer
closest
closet
closing
cloth
clothes
clothing
cloths
cloud
cloudy
club
clubs
cm
cms
cn
co
coach
coaches
coal
coaster
coat
coated
cobalt
cocktail
coconut
code
coded
codes
coding
coe
coffe
coffee
cogs
coin
coins
coke
cola
cole
collaborate
collapsing
collar
collars
collect
collected
collection
collector
collects
college
collide
collinear
collocation
colonies
colony
color
colored
colors
colour
coloured
colours
column
columns
com
combination
combinations
combine
combined
combining
combo
combustion
come
comedies
comer
comes
comined
coming
commence
commences
commerce
commercial
commission
commissions
committee
committees
commodity
common
communities
community
commute
commuter
companies
company
companyto
compare
compared
comparisons
compartment
compartments
compensation
competing
competition
competitive
competitors
complete
completed
completely
completes
completing
completion
complex
complimentary
component
components
composed
composite
composition
compositions
compound
compounded
compounding
compounds
comprise
comprised
comprises
comprising
compunded
computation
compute
computer
computers
concentrate
concentrated
concentration
concentric
concern
concerning
concert
concession
concessions
concrete
concurrent
condition
conditioned
conditioner
conditioning
conditionor
conditions
condominium
condos
conduct
conducted
conducts
cone
cones
confectioner
conference
confronts
congruent
connect
connected
connecting
connection
consecutive
consecutively
consequent
consicative
consider
considerable
considered
considering
consignment
consist
consisted
consistently
consisting
consists
consonant
constant
constitute
constitutes
constraint
construct
constructed
constructing
construction
constructor
consultants
consumable
consume
consumed
consumer
consumers
consumes
consumption
contact
contain
contained
container
containers
containg
containing
containning
contains
contemplates
contemplating
content
contents
contest
contestant
contestants
contested
continents
continue
continued
continues
continuing
continuous
continuously
contract
contractor
contracts
contrary
contribute
contributed
contributes
contribution
contributions
control
controlled
conversation
convert
convertible
convertibles
conveyance
conveyor
cook
cookie
cookies
cooking
cooks
cool
coordinate
coordinates
copied
copier
copiers
copies
copper
copy
cord
core
corn
corner
corners
corporation
correct
corrected
correction
correctly
correspond
corresponding
corresponds
corvette
cost
costing
costs
could
count
counted
counterfeit
counties
countries
country
county
coupe
couple
couples
coupon
coupons
courier
course
courses
court
courty
courtyard
cover
covered
covering
covers
cow
cows
cp
cr
crackers
craig
crate
crates
crayons
crazy
cream
creams
create
created
creates
creature
creatures
credit
credits
crew
crews
cricket
cricketer
criminal
cristina
criteria
cross
crossed
crosses
crossing
crossroads
crow
crown
crumbs
crushed
cs
cu
cub
cube
cubes
cubic
cubical
cubicle
cuboid
cuboidal
cuboids
cucumbers
cultivated
cultivating
cultural
cup
cupboard
cups
currency
current
currently
curriculum
curriculums
curvature
curved
custom
customer
customers
cut
cuts
cutting
cx
cy
cycle
cycled
cycles
cyclic
cycling
cyclist
cyclists
cylinder
cylinders
cylindrical
d
daal
dacid
daily
dairy
daisy
dal
dallas
dam
damaged
dames
dan
dana
daniel
danny
dante
darcy
dark
darkness
darren
dart
dartboard
data
date
dates
daughter
daughters
david
dawn
dawson
day
dayhe
days
daysrespectively
dayswas
daytime
dc
de
dead
deal
dealer
dealership
dealing
dean
dearness
death
debanshu
debate
debating
debby
debenture
debentures
debony
debt
decade
decades
decaffeinated
decb
deceased
deceleration
december
decide
decided
decides
decimal
decimals
decimeter
deck
declared
declares
declined
decorative
decrease
decreased
decreases
decreasing
decreasingthe
decrements
deduce
deducing
deducted
deductibles
deducting
deduction
deductions
deep
deepak
deeper
deepthi
deer
deers
def
defeat
defeated
defective
defectives
deficit
define
defined
definite
degree
degrees
del
delay
delhi
delicious
deliver
delivering
delivers
deluxe
demand
democrat
democrats
denali
dennis
dennison
denomination
denominations
denominator
denotes
denser
density
depart
departed
department
departmental
departments
departs
departure
dependent
depletiation
depletion
deposit
deposited
depositing
deposits
depot
depreciates
depression
depth
derek
derivative
derived
desalination
descend
descending
descends
described
describes
designed
designer
desired
desk
desks
dessert
destination
destinations
destiny
detached
detected
detention
detergent
determine
determined
determines
detination
dev
developed
development
develops
deviation
deviations
device
devices
dexter
dfrac
dhoni
diagonal
diagonally
diagonals
diameter
diameters
diametrically
diamond
diamonds
diana
diane
dice
dices
dick
did
die
died
diego
dies
diesel
dieselto
diet
diference
diferent
diff
differ
difference
differences
different
differential
differentiate
differently
difficult
difficulty
dig
digging
digit
digital
digits
digree
digs
diluted
dimension
dimensional
dimensions
diminished
diminishes
diner
dining
dinley
dinner
dinning
dioxide
dip
diploma
diplomats
direct
direction
directions
directly
directors
dirt
dis
disallows
disappeared
disassemble
discarded
discharge
discharged
discharging
discontinued
discount
discounted
discounting
discounts
discover
discovered
discovers
discovery
discretionary
discuss
discussion
dish
dishes
dishonest
dishwasher
disk
disks
dislike
dispatch
dispatched
dispenses
displacement
display
displayed
displaying
dispose
disregarded
dist
distance
distances
distane
distinct
distribute
distributed
distributes
distributing
distribution
distributor
district
districts
ditch
dive
diver
divide
divided
dividedby
dividend
dividends
divident
divides
dividing
dividingthe
dividinng
diving
divisible
division
divisior
divisor
divisors
dm
do
dock
doctor
doctors
document
does
dog
dogs
dogsled
doing
doll
dollar
dollars
dolls
dolphin
domestic
don
donald
donated
donation
donations
done
donkeys
donovan
dont
doohickies
door
doors
dorathy
doris
dormitory
dot
dots
double
doubled
doubles
doubling
doug
dough
doughnuts
douglas
down
downhill
download
downstream
downtown
downward
dozen
dozens
drain
drainage
drained
draining
drains
dramas
drank
draw
drawing
drawn
draws
dress
dresser
dresses
dressing
dressings
drew
dried
drier
driers
dries
drift
drink
drinks
drive
driven
driver
drivers
drives
driveway
driving
drop
dropped
dropping
drops
drove
drum
dry
drying
dubblefud
duck
ducks
due
dues
dug
dumping
dune
dunes
dungeons
duplicate
durango
duration
durations
during
dust
duty
dvd
dylan
dynaco
dynamics
e
each
eachday
eachextra
eachother
earl
earlier
early
earn
earned
earning
earnings
earns
earrings
earth
earthquake
east
eastward
easy
eat
eaten
eating
eats
ec
economics
economy
ed
eddie
eddy
eden
edge
edges
edit
editors
edits
educated
education
edward
eesha
ef
effect
effective
effects
efficiencies
efficiency
efficient
efforts
efrida
egg
eggs
eight
eighteen
eighth
eighths
eighty
eill
either
eithertrueorfalse
elaine
elapse
elder
eldest
elected
election
elective
electric
electricity
electron
electronic
electronics
element
elementary
elements
elena
elephants
elevation
elevator
eleventh
eli
eligible
eliminate
eliot
ella
ellen
ellipse
else
elvin
emergency
emerges
emigration
emits
emma
emploies
employ
employed
employee
employees
employer
employers
employment
employs
emptied
empties
empty
emptying
emptys
ems
enable
enables
enclose
enclosed
encloses
encosed
encyclopedias
end
endpoints
ends
energy
enforcement
engaged
engages
engine
engineer
engineering
engineers
engines
english
enhanced
enjoy
enjoyed
enlarged
enough
enroll
enrolled
enrollment
ensure
enter
entered
enters
entertainment
entire
entirely
entitled
entrance
entries
entry
envelop
envelope
envelopes
envelops
environment
equal
equaled
equalled
equally
equals
equation
equations
equidistant
equilateral
equip
equiped
equipment
equipped
equities
equivalent
erased
eraser
erasers
erica
erik
ernakulam
erred
error
escalator
esha
especially
establishment
estate
estates
estimated
estimates
estimation
etc
ethanol
eurasian
europeans
euros
evaluate
evans
evaporate
evaporated
evaporates
even
evening
evenly
event
events
eventually
ever
everest
every
everybody
everyday
everyone
everything
ex
exact
exactly
exam
examination
examinations
examine
examined
example
examples
exceed
exceeded
exceeding
exceeds
excel
except
excess
exchange
excluded
excluding
exectly
executive
executives
exercise
exhaust
exhausted
exhibit
exhibition
exist
exists
exit
exits
exp
expansion
expect
expected
expects
expenditure
expenditures
expense
expenses
expensive
experience
experienced
experiment
experimental
experiments
experts
explain
explains
explanation
explanationthanks
explode
exponent
exponential
exponents
express
expressed
expressing
expression
expressions
extend
extended
extensions
extent
external
extra
extract
extracted
extraordinary
extras
extremes
eye
eyeliners
eyes
f
fabrics
face
faced
faces
facial
facility
facing
factor
factorial
factorization
factors
factory
faculty
fahrenheit
fail
failed
failing
fails
failure
fair
fall
fallen
falling
falls
false
families
family
famous
fan
fans
far
fare
farenheit
fares
farm
farmed
farmer
farming
farmland
farther
faruk
fashion
fast
faster
fastest
fat
father
fathers
fault
faulty
favor
favorable
favorite
favour
favoured
fbc
fdi
fear
feast
features
feb
febraury
february
fed
fee
feed
feeding
feeds
feel
fees
feet
fell
fellow
felt
felts
female
females
fence
fenced
fencemaker
fencers
fences
fencin
fencing
fencingthe
ferris
ferry
fertilizer
fescue
festival
fetch
fetched
fetching
few
fewer
fewest
fg
fgh
fiber
fiction
field
fields
fifa
fifteen
fifth
fifths
figure
figures
file
filed
files
fill
fille
filled
filling
fills
film
films
filter
filters
final
finally
finance
financial
find
finds
fine
fined
fines
fingered
fingers
finish
finished
finishes
finishing
finland
fint
fire
fires
firing
firm
first
fiscal
fish
fisherman
fishermen
fishery
fishes
fist
fit
fitted
five
fix
fixed
fixes
flag
flagpole
flags
flagstaff
flash
flashes
flashlight
flat
flats
flavor
flavored
flavoring
flavors
flea
fleas
fleet
flew
fliers
flies
flight
flights
flip
flipped
flips
floating
flooded
floor
floored
flooring
floors
florist
flour
flow
flowed
flower
flowerman
flowers
flowery
flowing
flows
fluorescent
fly
flying
fn
fo
fodder
foer
fog
foil
fold
folded
folder
folders
followed
following
follows
fonzie
food
foods
foot
footat
football
footwear
for
forbid
force
forced
ford
forecasts
foreign
forest
forested
forfeits
forget
forgets
forgot
forgotten
form
formation
formations
formed
former
forming
forms
formula
formulation
fort
forth
fortnight
fortunately
forty
forum
forward
found
fountain
four
fours
foursome
fourth
fourths
fox
fraction
fractional
fractions
fragrant
frame
frames
francisco
frank
frazer
fred
freddy
free
freely
freezer
freight
french
frenzy
frequency
frequented
frequently
fresh
freshly
freshmen
friday
friend
friendly
friends
fringe
frisbee
frisbees
fro
frogs
from
front
frozen
fruit
fruits
ft
fth
fuchsia
fuel
fuji
fulfill
fulfilled
fulfills
full
fully
fumed
function
functional
functions
fund
funds
fur
furniture
furred
further
furthermore
future
g
gabriel
gain
gained
gaining
gains
gala
gallery
gallon
gallons
gambler
game
games
ganesh
gang
ganpat
garage
garden
gardener
gardens
gardensquare
garment
garments
garrison
gary
gas
gases
gaskets
gasohol
gasoline
gate
gates
gather
gave
gb
gcd
gcf
ge
gear
gears
geegaws
geese
geeta
geetha
gemstones
gender
general
generation
generic
genetically
gentleman
gentlemen
gently
geoff
geography
geometric
geometry
george
gerbils
germain
german
germinated
germs
get
gets
getting
gfhave
ghana
ghee
gic
gics
gift
gifts
giraffes
giri
girl
girlfriend
girls
give
given
gives
giving
gk
glacier
glass
glasses
glen
global
gloria
glove
gloves
glow
glows
glucose
glued
glycerin
gm
gmaes
gmat
gms
gnh
go
goa
goal
goals
goat
goats
goes
gof
gohul
going
gokul
gold
golds
golf
golfing
golu
gone
gonzalia
good
goods
goose
gopal
gopi
goshawk
got
gotham
gotin
government
gp
gpa
grab
grabbed
grabs
grace
grade
graders
grades
gradually
graduate
graduates
graduating
graduation
grain
gram
grams
grand
grandchildren
grandma
grandmother
grandparents
grandson
granite
grape
grapefruit
grapefruits
grapes
graph
grass
grassy
gratuity
gravel
graveling
gravelling
gray
graze
grazed
grazing
great
greater
greatest
greed
green
greenville
greg
gretzky
grew
grinder
grocer
groceries
grocery
groom
groomer
gross
ground
group
grouped
groupings
groups
grove
grow
growing
grown
grows
growth
gthe
guarantee
guaranteed
guarantees
guaranty
guard
guess
guesses
guessing
guest
guests
guide
gujarat
gujarati
gum
gumball
gumballs
gunny
guy
guys
gwen
gym
gyroscope
h
ha
habitat
had
haggled
hair
haircut
haired
half
halftime
halfway
hall
halt
halting
halved
halves
halving
hamburgers
hammer
hammers
hamsters
hand
handed
handle
handled
handling
handmade
hands
handshake
handshakes
hangars
hanging
hannah
hanson
happen
happened
happening
happens
happily
happy
harbor
hard
hardback
hardbacks
hardcover
hardest
hardware
hare
haresh
hari
harish
harkamal
harmful
harold
harriet
harry
harsha
harvest
harvested
has
hat
hatched
hate
hats
have
haveinvestments
haven
havenotpassed
having
hawaiian
hawks
hcf
he
heabsent
head
headaches
heading
heads
health
healthier
healthy
heap
hear
heard
heart
hearts
heat
heather
heaviest
heavily
heavy
hectare
hectares
height
heights
heinz
hel
held
help
helper
helpers
helping
hema
hemisphere
hemispheres
hemispherical
hen
hence
henrikh
henry
hens
her
herd
here
hernandez
hers
herself
hexa
hexagon
hg
hierarchical
high
higher
highest
highlighters
highway
hike
hiked
hiker
hikers
hikes
hiking
hill
hillary
hillock
hillside
him
himself
hindi
hindus
hint
hip
hire
hired
hires
hiring
his
hismarks
historical
history
hit
hits
hive
hll
hno
hobby
hockey
hoe
hokey
hold
holding
holdings
holds
hole
holiday
holidays
hollow
home
homeowners
homes
homework
honda
honey
honor
hoop
hoops
hope
hoping
hops
horizontally
horse
horses
horseshoes
hose
hospital
host
hostel
hot
hotel
hour
hourglass
hourly
hourr
hours
hoursa
hoursday
hous
house
household
households
houses
housing
how
howe
however
howmany
howmuch
howrah
hr
hree
hrs
http
huey
huge
human
hundreds
hundredth
hundredths
hung
hunt
husband
husbands
husk
hx
hyderabad
hydrogen
hypotenuse
hypothesis
hypothesisconcerning
hypothetically
i
ian
ice
iceland
id
ideal
identical
identification
identify
idle
ie
if
ifaequals
ift
igneous
ignore
ignoring
ih
ii
iii
iim
ill
illegally
illinois
illiterate
image
imagine
immediately
immersed
immidiate
immigration
implement
implements
import
imported
importer
imports
impossible
impression
impressions
impressive
improper
improve
improved
impurities
in
ina
inc
incandescent
incentive
incentives
inch
inches
incircle
include
included
includes
including
inclusive
income
incomes
incorrect
incorrectly
increase
increased
increases
increasing
incredible
increment
incur
incurred
indeed
indefinitely
independence
independent
independently
index
india
indian
indians
indicate
indicated
indicates
indicating
indifferent
indigo
indira
indirect
indirectly
indisposed
individual
individually
individuals
indoor
indra
indu
industrial
industry
ineither
inequalities
inequalitites
inequities
infants
infected
inferior
inflation
inflow
influence
info
information
ing
ingredients
ingrid
inhabitants
inheriting
initally
initial
initially
initiallyin
initials
injures
ink
inlet
inlets
inmates
inner
innermost
inning
innings
innovative
inradius
inscribed
insect
insects
inserted
inside
insists
inspect
inspected
inspection
inspector
inspectors
inspects
install
installation
installed
installment
installments
instalment
instalments
instance
instant
instead
institute
instructions
instrument
instruments
insulation
insurance
insured
int
integer
integers
integerskgreater
integral
integratedlearning
integrity
intelligence
intend
intended
intends
intensity
inter
intercept
intercepts
interchanged
interchanges
interchanging
intercollegiate
interconnected
interest
interested
interesting
interests
intergers
interior
intermediate
intern
internal
internally
international
internet
intersect
intersected
intersecting
intersection
intersections
intersects
interval
intervals
interview
interviewed
interviews
into
intrest
intuitively
invalid
inventory
inversely
invest
invested
investing
investment
investments
investmentsin
investor
investors
investorsin
invests
invited
invites
involved
involves
involving
iron
irwin
is
isabella
isan
isengaged
island
ismade
isoceles
isosceles
iss
issued
ist
isthe
it
italian
item
items
its
itself
j
jack
jackal
jacket
jackie
jackson
jaclyn
jacob
jade
jake
jam
jamal
james
jamie
jamshid
jan
jana
jancy
jane
janet
janitor
january
japanese
jar
jarry
jars
jasmine
jason
jatin
java
jawans
jaya
jayant
jayes
jean
jeans
jeep
jeff
jefferson
jelly
jellybeans
jen
jenee
jenn
jenna
jennifer
jenny
jerry
jersey
jerseys
jessica
jewelry
jhon
jill
jills
jim
jimmy
jjj
jkl
jklm
jo
joan
job
jobif
jobs
joe
joel
joelle
joes
joey
jog
jogged
jogger
jogging
jogs
john
johnny
johns
johnson
johnsons
join
joined
joinedhim
joining
joins
joint
jointly
jolene
jonathan
jones
jony
jordan
jose
joseph
josh
journey
journeymen
juan
juans
judges
jug
juggler
jugs
juice
julia
julie
juliet
july
jumbo
jump
jumps
junction
june
jungle
junior
juniors
just
justify
jutting
jyothi
k
kabadi
kale
kamal
kamla
kanul
kanyakumari
karan
kareem
kareena
karen
karl
karnataka
karthik
kate
katherine
kathleen
kavi
kaya
kayak
kayaks
kaye
kaz
kc
keats
keep
keeper
keepers
keeping
keeps
kelly
kelsey
ken
kendra
kennedy
kennel
kept
kerosene
kerrania
ketaki
key
keys
kg
kgs
khans
khantkar
kho
kid
kids
kill
killed
kills
kilo
kilogram
kilograms
kiloliter
kilometer
kilometers
kilometre
kilometres
kilos
kim
kind
kindergarten
kinds
king
kingfishers
kinkos
kiran
kishore
kit
kitchen
kite
km
kmh
kmpb
kmph
kmps
kms
knit
knitting
knockout
know
known
knows
kola
kolkata
kph
kramer
krish
krishan
kul
kureishi
kutty
kw
kx
kyle
l
lab
label
labeled
labeling
labelled
labor
laboratory
laborers
labour
labourer
laboures
labours
lacs
ladder
ladders
ladies
lady
lagaan
lagarithm
lagging
laid
lake
lakh
lakhs
lamp
lamps
lan
lana
land
landing
lands
landscape
lang
lange
language
languages
lanka
lap
lapis
laps
lapse
laptop
large
largely
larger
largest
larget
larry
las
lasso
last
lasted
lasts
lata
late
later
lateral
latest
latin
latter
lattice
launched
laundromat
laundry
laura
laureates
law
lawn
lawyer
lawyers
laxmi
layer
layers
layout
lb
lbs
lcm
lead
leading
leads
league
leak
leakage
leaked
leaning
leap
leaps
learn
learns
leas
least
leastvalue
leave
leaves
leaving
led
leela
left
lefthanded
leftmost
leg
legged
legs
leisurely
lemon
lemonade
lemonhead
lemons
lend
lender
lends
lenght
lenghtwise
length
lengthis
lengths
lengthwise
lens
lent
leo
lesley
less
lesser
let
lets
letter
letters
lettuce
level
leveling
levels
levied
lewis
lf
liam
liberal
libraries
library
lice
license
lid
lie
lies
life
lifesaving
lifetime
lift
lifting
lifts
light
lighted
lightest
lighthouse
lights
like
liked
likely
likerebus
likes
lilly
lily
limit
linda
lindy
line
linear
linearly
lined
liner
lines
lionel
lions
liquid
liquids
lisa
list
listco
listed
listening
listing
lists
lit
liter
literacy
literate
literature
liters
litre
litres
litter
littermate
littermates
litters
little
live
lived
lives
living
lizard
ll
lloyd
load
loaded
loading
loads
loaf
loan
loaned
loaves
local
locals
located
location
locations
lock
locked
locusts
loe
log
logan
logged
logic
logo
logx
lola
long
longer
longest
look
looked
looking
looks
loom
looms
loop
loot
lopez
lorry
lose
loser
loses
losing
loss
losses
lost
lot
lottery
louie
louis
louisa
lourdes
love
lovelost
lover
lovers
low
lower
lowered
lowest
loyd
ls
lt
ltr
ltrs
lts
lubricants
lucia
luck
luckily
lucknow
lucky
lunch
lunches
luxury
luyang
lying
m
maaza
mabel
mac
machine
machinery
machines
madagascar
madan
made
madhav
madison
magazine
magazines
maggie
magic
magnified
magnitude
magoosh
maharashtra
mahesh
mahi
mail
mailed
mailing
main
mainland
maintain
maintained
maintaining
maintains
maintainthe
maintenance
maitre
major
majored
majoring
majority
majors
make
makein
makeing
maker
makes
making
malati
male
males
malfunction
malfunctioning
malibu
mall
malmo
malt
man
manage
managed
management
manager
managers
manages
managing
mandy
manfred
manganese
mango
mangoes
mangos
manhattan
manner
manoj
manufacture
manufactured
manufacturer
manufactures
manufacturing
manuscript
many
manydays
manyfewerhours
map
mar
marathi
marathon
marble
marbles
marcella
march
marching
marge
margin
marginal
maria
mariah
mark
marked
marker
markers
market
marketing
markings
marks
marksman
markup
marla
maroon
marriage
married
marry
marshmallows
mart
martian
martin
martins
marts
mary
mass
mat
match
matched
matches
matching
material
materials
math
mathamatics
mathematical
mathematics
maths
matrix
mats
matt
matte
matter
matthew
maturity
mauve
max
maximize
maximized
maximizing
maximum
maximun
maxine
maxwell
may
maya
mayor
mayoral
mba
mbas
mcdonald
mcq
me
meal
meals
mean
meaning
means
meant
measure
measured
measurement
measurements
measures
measuring
meat
mechanic
mechanics
medal
medals
median
medical
medicine
medicines
mediterranean
medium
meena
meet
meeting
meets
megabytes
megatech
megatek
melt
melted
melting
melts
member
members
membership
memory
men
menhir
mental
merchant
merge
mess
message
met
metal
metallic
metals
meter
meteres
meters
method
methods
methyl
metre
metres
metric
metro
mets
mexican
mg
miami
mice
michael
micheal
michelle
microbrewery
micron
microns
microorganisms
microphotonics
microscope
microtron
mid
middle
midpoint
midpoints
midway
might
migrants
migrated
migrating
migration
mike
mikes
mile
mileage
miles
military
milk
milked
milkman
milkmen
millet
millicent
milliliters
millimeters
million
millionaire
millions
millisecond
millk
min
minakshi
mind
mindy
mini
miniature
minimum
ministry
minor
mins
minus
minute
minutes
mirror
miscellaneous
misread
miss
missed
misses
missing
mission
mistake
mistook
mix
mixed
mixer
mixers
mixes
mixing
mixture
mixtures
ml
mm
mn
mnbc
mnts
mo
mobile
mock
mode
model
models
modem
modern
modified
mods
modular
module
modules
mohit
molecule
molecules
moli
molly
molten
mom
moment
mona
monday
mondays
monetary
money
monica
monitored
monkey
monkeys
montague
month
monthly
months
moon
moore
more
mork
morning
mornings
morse
mortar
mortgage
moses
most
motel
mother
mothers
motion
motor
motorbike
motorboat
motorcycle
motorcycles
motorcyclist
motorist
motorists
mould
mountain
mountains
mounting
move
moved
movement
movers
moves
movie
movies
moving
mow
mowed
mowers
mozzarella
mp
mpg
mph
mps
mr
mrs
ms
mt
mtr
mtrs
mts
much
mudit
muffin
muffins
mukesh
multiple
multiples
multiplication
multiplied
multipliers
multiplies
multiply
multiplying
mumabai
mumbai
municipality
museum
mushrooms
music
musicians
muslims
must
musthe
mustthe
mutter
mutual
mwny
mx
my
mypayments
mysoon
mysteries
n
nagar
nagpur
nail
nails
named
namely
names
nancy
nandan
naomi
narrow
nascar
natasha
national
natural
nature
nb
nches
nd
ne
near
nearby
nearest
nearly
necessarily
necessary
neck
necktie
neckties
nectar
need
needed
needs
negative
negatively
negligible
negotiated
neha
neighborhood
neighbors
neighbour
neither
nelly
nephews
nest
net
nets
network
never
nevertheless
new
newborn
newer
newly
newspaper
newspapers
next
ng
ngo
nhai
nice
nick
nickel
nicky
nieces
night
nigiet
niharika
niki
nina
nine
nineth
ninth
nisha
nishita
nitin
nitric
nn
no
nobel
noelle
nominal
non
none
nonfiction
nonnegative
nonofficers
noon
noontime
nor
norm
normal
normally
norms
north
northeast
northwards
norway
nose
nosed
not
notate
notation
note
notebook
notebooks
noted
notes
nothing
noticed
notices
noting
notsure
novel
november
novice
now
nowmakes
nr
nth
nuclear
num
number
numbered
numbering
numbers
numberz
numeral
numerals
numerator
numeratr
numeric
numerical
numerically
nursery
nurses
nuts
ny
nyc
nylon
o
oa
oab
oak
oar
oars
oarsmen
oates
obelix
object
objective
obligation
obra
observable
observation
observations
observed
observers
observes
observing
obtain
obtained
obtainedby
obtains
obtuse
occasionally
occupied
occupies
occupy
occur
occured
occurred
occurring
occurs
ocd
ocean
octagon
octane
october
octopus
odd
odds
of
ofa
ofboxes
off
offence
offer
offered
offering
offers
office
officer
officers
ofkare
oftheir
ofthese
ohms
oil
ois
old
older
oldest
olds
olive
olives
on
once
oncoming
one
ones
onions
online
only
onthe
onto
open
opened
opening
opens
operate
operated
operates
operating
operation
operations
operative
operator
operatoris
opinion
opp
opponent
opponents
opposed
opposite
opposites
opt
opted
optic
optimal
optimum
option
options
or
orange
orangeade
oranges
orchard
orchestra
order
ordered
orders
ordert
ore
organisation
organization
organizations
organize
organized
organizers
organzied
orientation
origin
original
originally
originated
orm
ornamental
ornaments
orphan
orr
osmosis
other
others
otherwise
ounce
ounces
our
out
outcome
outcomes
outdoor
outdoors
outer
outlay
outlet
output
outside
outstanding
over
overall
overcoat
overdue
overflow
overflows
overhead
overheads
overlap
overlapping
overs
overshoot
overtake
overtaken
overtakes
overtaking
overthrows
overtime
overtook
owe
owes
owing
owlna
own
owned
owner
owners
owning
owns
oxen
oxygen
oy
oz
p
pa
pace
pack
package
packaged
packages
packaging
packed
packet
packets
packing
packs
paddyfield
pads
page
pagers
pages
paid
paint
painted
painter
painters
painting
paintings
paints
pair
pairs
paisa
paise
palabras
palindrome
palindromes
palindromic
palnted
pan
pandas
panel
panic
pant
pants
papaya
paper
paperback
paperbacks
paperclips
papers
par
parakeets
parallel
parallelogram
parallelograms
parameter
parcel
parcle
parcles
parent
parents
park
parked
parking
parkway
parliament
parlor
parochial
parrots
parry
part
partially
participant
participants
participate
participated
participating
particular
parties
partly
partner
partners
partnership
parts
party
pascal
pass
passed
passenger
passengers
passes
passing
password
past
paste
pastry
pasture
pat
patch
path
paths
pathway
patience
patient
patients
patio
patna
patrick
pattern
patty
paul
paula
paulson
pausing
pavan
pave
paved
paving
pay
payable
payal
payble
paycheck
paychecks
payer
paying
payment
payments
payoff
payroll
pays
pe
peach
peaches
peacocks
peanut
peanuts
pears
peas
peck
peculiarity
pediatrician
pediatricians
peel
pen
pencil
pencils
penguins
pennies
penny
pens
pension
pentagon
peopl
people
peoples
pepperoni
pepsi
per
perceived
percent
percentage
percentages
percents
percussion
perfect
perfectly
perform
performance
performances
performed
performs
perfume
perimeter
perimeters
period
periods
periphery
permanent
permeter
permission
perpendicular
persent
person
personal
persons
pests
pet
pete
peter
petersons
petri
petrol
pets
pgm
pharmaceutical
phase
phd
phenomenon
phil
phoenix
phone
phones
photocopies
photocopy
photograph
photographer
photographers
photos
physical
physics
pi
picasso
pick
picked
picking
picks
picnic
picture
pictures
pie
piece
pieces
pies
pig
pigeon
piggy
pigment
pigs
pillar
pillow
pillows
pilot
pineapple
pinedale
ping
pink
pint
pints
pintu
pionted
pipe
pipeline
pipes
pit
pitch
pitcher
pizza
pizzas
pizzeria
pla
place
placed
places
placing
